# Напишите программу для печати всех уникальных значений в списке словарей.# Примечание: Список словарей задан изначально. Пользователь его не вводит
# Обратите внимание, что в словарях может быть один или несколько элементов Примеры/Тесты:
# Input: [{"V": "S001", "X": "D009"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005", "XI": "D011"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 ", "XII": "D001"}]# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

list1 = [{"V": "S001", "X": "D009"},{"V": "S002"}, {"VI": "S001"},{"VI": "S005", "XI": "D011"}, {"VII": " S005 "}, {" V ":" S009 "},{" VIII ":" S007 ", "XII": "D001"}]    

num = set()

# [*] Усложнение. Проверку уникальности строк сделайте без учета пробелов до и после значимой части строки
for i in list1:    
    for key, val in i.items():
        num.add(val.strip())
print(num)

# [**] Усложнение. Запишите алгоритм в одну строку, используйте Comprehension
num2 = {val.strip() for i in list1 for key, val in i.items()}
print(num2)
